addons/binding/org.openhab.binding.ihc.test/src/test/resources/ResourceValueQueryResponse77777.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getRuntimeValue2 xmlns:ns1="utcs" xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">77777</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string">resource_date</ns1:typeString>

<ns1:value xmlns:ns2="utcs.values"  xsi:type="ns2:WSDateValue">
<ns2:day xsi:type="xsd:byte">22</ns2:day>

<ns2:month xsi:type="xsd:byte">10</ns2:month>

<ns2:year xsi:type="xsd:short">2018</ns2:year>
</ns1:value>
</ns1:getRuntimeValue2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>